{
    "ipipResult" : {
        "result": "",
        "result_info": {
            "High-C": "Concientiousness dominates by a large margin, which means a tendency to act dutifully, and strive for achievement even against measures or outside expectations. If this dimension dominates it means very strong control of impulses and a predisposition to intense planning and industriousness. Low conscientiousness is associated with spontaniety and impulsiveness. High conscientiousness can be seen as stubborn or headstrong.",
            "High-E": "Extraversion dominates by a large margin, which means a tendency to pursue external stimuli, and be energized by social environments. If this dimension dominates it manifests as energy, talkativeness and assertiveness. High extraversion can be seen as boisterious and uninhibited. Low extraversion is an individual with more reserved, withdrawn characteristics.",
            "High-A": "Agreeableness dominates by a large margin, which means a tendency to be considerate to others. If this dimension dominates it means an individual has the traits: straightforwardness, compliance, modesty, trust and sympathy. Agreeableness typically manifests as altruism, or seflessness. An individual with very high altruism can put others interests ahead of theirs. High Agreeableness can be perceived as being overly sensitive. Low Agreeableness is associated with more competitive and challenging.",
            "High-I": "Intellect/Imagination dominates by a large margin, which means a tendency to prefer aesthetics, idealizations, creativity and variety. Attentiveness to inner feelings is another characteristic of high-I. If this dimension dominates it manifests as a desire to experience the new and original. Low-I is associated with preferring a narrow range of experiences. High-I can be prone to self-examination and seen as unconventional.",
            "High-S": "Emotional Stability dominates by a large margin, which indicates a capacity to withstand conflicts and issues, handle adversity, and remain productive and capable throughout. This dimension is a positive indicator. Low emotional stability is also labelled as emotionally reactive. Emotional stability is not associated with the ability to express feelings. High emotional stability is perceived as even-tempered and composed.",         
			"High-CE": "Concientiousness and Extraversion dominate, which means the individual acts in a dutiful and assertive way. These two dimensions describe an individual with an outgoing and driven leader personality type. High extraversion can be seen as energetic and talkative. High conscientiousness is seen as industrious and structured.",
            "High-AC": "Agreeableness and Concientiousness dominate, the confluence of these two dimensions is uncommon. These traits manifest as a balance of behaving in structured but intentful way. These two dimensions describe an individual that is open-minded and considers others while maintaining an orderly and structured personal environment. High agreeableness is perceived as considerate and altruistic. High conscientiousness is seen as industrious and structured.",
            "High-CI": "Concientiousness and Intellect/Imagination dominate, the confluence of these two dimensions is uncommon. These seemingly contradictory traits manifest as a balance of strict routine and desire to experience a variety of things. These two dimensions describe an individual that prefers to approach new experiences in a structured and planned way. High conscientiousness is seen as industrious and structured. High-I is perceived as preferring a wide range of experiences.",
            "High-CS": "Concientiousness and Emotional Stability dominate, these two dimensions are commonly associated. These traits manifest as having a commitment to a very structured and stable lifestyle. These two dimensions describe an individual that is industrious and capable of handling adversity. High conscientiousness is seen as industrious and structured. High emotional stability is perceived as the ability to handle challenges and conflicts with emotional composure.",
            "High-EA": "Extraversion and Agreeableness dominate, these two dimensions are commonly associated. These traits manifest as an outgoing and affable personality type. These two dimensions describe an individual who is prosocial and enjoys maintaining and strengthening relationships. High extraversion can be seen as energetic and talkative. High agreeableness is perceived as considerate and altruistic.",
            "High-IE": "Intellect/Imagination and Extraversion dominate, which means a tendency to explore new experiences, often in a group environment. These two dimensions describe an individual who is prosocial and has a variety of interests outside the traditional. High-I is perceived as preferring a wide range of experiences. High extraversion can be seen as energetic and talkative.",
            "High-ES": "Extraversion and Emotional Stability dominate, which means a heightened ability to handle social situations and conflict. These two dimensions describe an individual who is outgoing and composed in most environments. High extraversion can be seen as energetic and talkative. High emotional stability is perceived as the ability to handle challenges and conflicts with emotional composure.",
            "High-AI": "Agreeableness and Intellect/Imagination dominate, which means a heightened ability to consider others and in an open-minded way. These two dimensions describe an individual who is \"empathetic\" and has a variety of interests outside the traditional. High agreeableness is perceived as considerate and altruistic. High-I is perceived as preferring a wide range of experiences.",
            "High-AS": "Agreeableness and Emotional Stability dominate, which means a greater capacity to understand others, their intentions and be sincere. These two dimensions describe an indivdual who is down to earth and relatable to others. High agreeableness is perceived as considerate and altruistic. High emotional stability is perceived as the ability to handle challenges and conflicts with emotional composure.",
            "High-IS": "Intellect/Imagination and Emotional Stability dominate, which means a tendency to explore new experiences with resilience. These two dimensions describe an individual who is capable of handling challenges that arise from new environments or situations. High-I is perceived as preferring a wide range of experiences. High emotional stability is perceived as the ability to handle challenges and conflicts with emotional composure."
        }
    },
    "jtResult": {
        "result": "",
        "result_info": {
            "ISFJ": "Conscious and altruistic. Usually protective and down to earth, the ISFJ has a strong grasp of relationships and how to strengthen them. At their best, they are a model citizen and rally behind causes that align with their morality and beliefs. The ISFJ can be judgemental and condemn actions and behaviors that are percieved as immoral. The ISFJ has strong foundation and is not easily swayed from their morals.",
            "ESFJ": "Emotionally acute and engaging. Typically empathetic and inclusive, the ESFJ has penchant for social interaction and creating harmony. At their best, they are adept at understanding people and their emotional needs. The ESFJ cares for others and can sometimes neglect their own needs. The ESFJ strives for perfection and fellowship in their life.",
            "ISTJ": "Logical, and reliable. Usually a rule-follower and no-nonsense type of person, the ISTJ is very responsible and dependable. At their best, they dutifully provide for a community and uphold their standards they percieve as just. The ISTJ can become too driven and become oblivious to others. The ISTJ excels at building practical systems of the world.",
            "ISFP": "Creative and intentful. Typically highly aware and positive, the ISFP channels their creativity towards expressing themselves. At their best, they are emotionally available and can make those around them comfortable. The ISFP can display volatile emotion. The ISFP expresses their strong feelings in impactful ways.",
            "ESTJ": "Efficient, and detail-oriented. Usually organized and attentive, the ESTJ has drive for perfection and managing work. At their best, they are high-energy and can identify tools and systems that improve productivity. The ESTJ can overthink planning in order to mitigate risk. The ESTJ uses their high attention to detail to reach and uphold their standards.",
            "ESFP": "Influential, and social. Typically expressive and energetic, the ESFP enjoys being the center of attention. At their best, they leverage their charisma to bring their goals to fruition. The ESFP can be dependent on reaching a certain status. The ESFP uses their confidence in social environments to influence and achieve.",
            "ENFP": "Insightful, and  intuitive. Usually perceptive and understanding, the ENFP grasps new concepts with quickly. At their best they can develop models of relationships, behavior and abstract concepts in a profound way. The ENFP can become lost in their idealized world. The ENFP uses their personal observations to elucidate abstract phenomenon.",
            "ISTP": "Tactile, and rational. Typically in tune with their environment, the ISTP has a innate sense of function and accuracy. The ISTP lives in the moment. At their best they can leverage their fundamental understanding of rationality and apply to tangible goals. The ISTP has difficulty interpreting intentions and opening up emotionally. The ISTP has a strong grasp of how things work and how to apply it instinctively.",
            "INFP": "Introspective and original. Usually creative and passionate, the INFP has a rich inner world of imagery and innovation. At their best they can express their ideas and theories in vivid detail. The INFP can become reserved and prefer their imagination. The INFP is acutely aware of how their creations affect the emotional state of others and inspire.",
            "ESTP": "Competitive, and entrepreneurial. Typically high-energy and intense, the ESTP has a natural impetus to accomplish goals. At their best they can inject themselves into chaotic environments and perform at high-level. The ESTP can become overbearing and neglect how their actions affect others. The ESTP is has the motivation to make their dreams and goals a reality.",
            "INTP": "Pensive, and curious. Usually intelligent and thoughtful, the INTP has the capacity to explore the fringes of any given concept. At their best they use their deep understanding to prove nebulous theories or logical inconsistencies. The INTP can vecome secluded in their thoughts and depend too much on accuracy of information. The INTP uses empirical evidence to point out flaws and improvements and provide accurate guidance.",
            "ENTP": "Independent, and inventive. Typically enthusiastic and perceptive the ENTP grasps abstract concepts with peerless speed. At their best they can break down societal rules and propose an improved theory. The ENTP can become adversarial to the norm. The ENTP is adept at understanding their environment and building a wealth of knowledge.",
            "ENFJ": "Considerate, and charismatic. Usually genuine and open, the ENFJ is adept at bringing people together and identifying strengths and weaknesses. At their best they are good leaders that encourage participation of different personalities using their keen judgement. The ENFJ can by virtue, take transgressions too personally. The ENFJ has a strong preference to inspiring leadership",
            "INTJ": "Tactical, and incisive. Typically clever and rational, the INTJ discovers possiblities and approaches that are often novel. At their best they can synthesize different concepts and arrive at solutions to difficult problems. The INTJ can become disconnected with the world and isolate. The INTJ leverages their powerful analysis to discard extraneous details and extract important information.",
            "ENTJ": "Confident and persistent. Usually focused and visionary, the ENTJ has peerless foresight. At their best they can use their pattern recognition and extraversion to effectively make executive decisions. the ENTJ can become insensitve to others if they are too focused on external achievements. The ENTJ values progress and results.",
            "INFJ": "Empathetic and motivated. Typically compassionate and ethical, the INFJ constantly formulates value-driven goals and understands others intentions and perspectives. At their best they can inutitively grasp others beliefs while pursuing their own. The INFJ can become overly sensitive to negativity. The INFJ uses their unique worldview to empathize with others and reveal value."
        }
    },
    "discResult" :  {
        "result": "",
        "result_info": {
            "D": "Dominance is defined as a person who is competitve, results-oriented, very decisive and adept at solving problems. However, fears being taken advantage of or appearing weak. In conflict, speaks up about problems and settles the score.",
            "I": "Influence is defined as person who is persuasive, charismatic, ethusiastic and has good interpersonal skills. However, fears rejection or being ignored. In conflict, has tendency to display unfiltered emotion.",
            "S": "Steadiness is defined as person who is patient, sincere, stable, dutiful and a good team player. However, fears letting people down or dramatic change. In conflict, typically puts outside needs ahead of their own.",
            "C": "Conscientiousness is defined as a person who is objective, analytical, precise and is very pragmatic. However, fears displaying strong emotion or appearing wrong. In conflict, focuses on facts, logic and objectivity."
        }
    },
    "fpqResult" :  {
        "result": "",
        "result_info": {
            "Explorer": "Explorers are Curious/Energetic. They are highly curious, seek new experiences and enjoy novelty. Explorers prefer to live in the moment. They typically have a lot of energy which motivates them to try new things. The associated brain chemicals are dopamine, norepinephrine. ",
            "Builder": "Builders are Cautious/Social Norm Compliant. They are very precise and value routines and consistency. Builders are typically grounded and fact-based. They prefer to focus on tasks and do them right the first time. The associated brain chemicals are serotonin.",
            "Director": "Directors are Analytical/Tough-minded. Directors are resourceful, forthcoming and make excellent leaders. They are sure of themselves and very direct when engaging with others. The associated brain chemicals are dopamine, testosterone.",
            "Negotiator": "Negotiators are Prosocial/Empathetic. Negotiators are highly empathetic, and are skilled at connecting people and creating harmony. They are expressive and like when everyone gets along. The associated brain chemicals are estrogen, oxytocin."
        }
    },
    "eqResult" :  {
        "result": "",
        "result_info": {
            "High-eq": "A high EQ means high receptibility to emotional information, this serves to guide thinking and behavior. High EQ is thought to be the enhanced ability to recognize the emotions in others and leadership skills. A shortcoming is that high EQ correlates to lower creativity and risk-taking.",
            "Mid-eq": "An average EQ means being adept at picking up emotions and reading a room. However, not to the extent of an individual with high EQ. Overall, it signifies a normal capacity to handle emotional information.",
            "Low-eq": "a low EQ means low receptibility to emotional information. This could manifest as behaving with less regard for other's emotions and more impulsiveness. Low EQ is linked to lower empathy, which can mean a higher priority of personal ambitions."
        }
    },
    "eopsResult" :  {
        "result": "",
        "result_info": {
            "Reformer": "Type 1, is rational, steadfast, idealistic and dutiful. They are concerned with making changes and improving. They can impatient, have low tolerance and be overly critical. A 9 wing is known as the idealist and a 2 wing is known as the advocate.",
            "Helper": "Type 2, is generous, demonstrative, caring and overbearing. They work to maintain harmony and please people. They can become possessive and have a need to be appreciated. A 1 wing is known as the servant and a 3 wing is known as the host/hostess.",
            "Achiever": "Type 3, is pragmatic, adaptable, driven, and ambitious. They wired to strive for progress. This drive to achieve can lead to eogism and workaholism. A 2 wing is known as the charmer and a 4 wing is known as the professional.",
            "Individualist": "Type 4, is sensitive, introspective, self-absorbed, and expressive. They are authentic and emotionally expressive. They can fall into melancholy and vulnerability. A 3 wing is known as the aristocrat and a 5 wing is known as the bohemian.",
            "Investigator": "Type 5, is perceptive, innovative, secretive, and cerebral. They are independent and thoughtful and see the world in a new way. They have tendency to isolate and overthink. A 4 wing is known as the iconoclast and a 6 wing is known as the problem solver.",
            "Loyalist": "Type 6, is responsible, secure, commited, and suspicious. They are very effective problem solvers but can be indecisive. They sometimes can be supsicious and overly cautious. A 5 wing is known as the defender and a 7 wing is known as the buddy.",
            "Enthusiast": "Type 7, is spontaneous, versatile, possessive and distractible. They can develop a variety of skills but have an unfocused approach to mastery. They constantly seek new experiences which can be exhausting. A 6 wing is known as the entertainer and an 8 wing is known as the realist.",
            "Challenger": "Type 8, is decisive, willful, and confident and confrontational. They seek to control their environment and can be domineering with a tendency for a short temper. It is difficult for this type to be vulnerable. A 7 wing is known as the maverick and a 9 wing is known as the bear.",
            "Peacemaker": "Type 9, is agreeable, reassuring, complacent and accomodating. They work to ensure peace with others around them and themselves. If disaffected, they can be stubborn but value keeping harmony. An 8 wing is known as the referee and a 1 wing is known as the dreamer."
        }
    },
    "chronoResult" :  {
        "result": "",
        "result_info": {
            "Morning-type": "Type that favors morning and functions best at this time.",
            "Day-type": "Type that favors neither morning or evening and functions during the day.",
            "Evening-type": "Type that favors evening and functions best at this time."
        }
    },
    "spiritResult": {
        "result": "",
        "result_info": {
            "Bear": "A symbol of power, ruggedness and deep connection to the nature.",
            "Dove": "A symbol of peace, balance and the link between the physical and mystical.",
            "Elephant": "A symbol of commitment, leadership and imposing presence.",
            "Fox": "A symbol of tactile prowess, awareness and affinity to the night.",
            "Hawk": "A symbol of focus, purpose, clarity and individualism.",
            "Owl": "A symbol of wisdom, aptitude and the gift of perception.",
            "Peacock": "A symbol of purity, self-confidence, and intrinsic knowledge of potential.",
            "Turtle": "A symbol of understanding, truth and earthly spirituality",
            "Wolf": "A symbol of primal instincts, cunning and connection to the pack.",
            "Dolphin": "A symbol of amiability, inner strength and natural ability to communicate and influence.",
            "Tiger": "A symbol of raw strength, adaptability and innate intuition.",
            "Deer": "A symbol of grace, confidence, instinctual ability and vigilance."
        }
    }
}
